import { Component } from '@angular/core';

@Component({
  selector: 'app-root',
  templateUrl: './app.component.html',
  styleUrl: './app.component.scss',
})
export class AppComponent {
  title = 'Etmaam';

  slides: { title: string; items: string[] }[] = [
    {
      title: 'ما قبل التأسيس',
      items: [
        'استمارة طلب ترخيص الاستثمار',
        'البيانات المالية للسنة السابقة',
        'نسخ جواز السفر للشركاء',
        'اثبات الهوية و اثبات العنوان للمدير و المعاونين',
        'نسخة مدققة للتفويض الكتابي',
      ],
    },
    {
      title: 'الوثائق المطلوبة لعملية الحجز',
      items: [
        'استمارة طلب ترخيص الاستثمار',
        'البيانات المالية للسنة السابقة',
        'نسخ جواز السفر للشركاء',
        'اثبات الهوية و اثبات العنوان للمدير و المعاونين',
        'نسخة مدققة للتفويض الكتابي',
      ],
    },
    {
      title: 'تأسيس النشاط',
      items: [
        'استمارة طلب ترخيص الاستثمار',
        'البيانات المالية للسنة السابقة',
        'نسخ جواز السفر للشركاء',
        'اثبات الهوية و اثبات العنوان للمدير و المعاونين',
        'نسخة مدققة للتفويض الكتابي',
      ],
    },
    {
      title: 'الوثائق المطلوبة للتأسيس',
      items: [
        'استمارة طلب ترخيص الاستثمار',
        'البيانات المالية للسنة السابقة',
        'نسخ جواز السفر للشركاء',
        'اثبات الهوية و اثبات العنوان للمدير و المعاونين',
        'نسخة مدققة للتفويض الكتابي',
      ],
    },
  ];

  items: string[] = [
    'أطلب خدمة',
    'من نحن؟',
    'الأسئلة الشائعة',
    'اتصل بنا',
    'انضم إلينا',
  ];

  servicesSlides = [
    {
      title: 'الخدمات القانونية | الالتزام القانوني',
      image: '../assets/svg/low.svg',
      description:
        'نحن نمتلك أفضل فريق قانوني في المملكة العربية السعودية مع سنوات من الخبرة والمعرفة، ونقدمها لك لتستفيد وتتمكن من رؤية السوق بمنظور مختلف.',
    },
    {
      title: 'تصفية الشركة',
      image: '../assets/svg/note.svg',
      description:
        'نحن في خدمتكم لتوفير حلول مبتكرة وسهلة التنفيذ التي تساعد على تحقيق نجاح شركتكم بكل يسر وسلاسة، دون مواجهة أي مشاكل أو عقبات.',
    },
    {
      title: 'خدمات الترجمة و تحسين التواصل',
      image: '../assets/svg/translate.svg',
      description:
        'نحن نقدم خدمات شاملة لتحسين التواصل ونساعدك على الحصول على أفضل صفقة وبناء علاقات ناجحة في مجال عملك.',
    },
    {
      title: 'الفيزا و التأشيرات في المملكة العربية السعودية',
      image: '../assets/svg/visa.svg',
      description:
        'نحن نقدم خدمات استشارية تساعدكم على اختيار التأشيرة الصحيحة ونقدم المساعدة في استخراجها بسهولة ويسر.',
    },
    {
      title: 'الزكاة و الضرائب و المعاملات المحاسبية',
      image: '../assets/svg/taxes.svg',
      description:
        'المحاسبة والإدارة والتسويق هم الأعمدة الثلاثة الأساسية لأي عمل، ونحن نقدم خدمات متكاملة تغطي هذه الجوانب لتعزيز عملك.',
    },
  ];
}
